import React, { Component } from 'react';

class AboutPage extends Component {
    render() {
        return (
            <React.Fragment>
                <h1>Онлайн-сервіс логістичної компанії</h1>
                <p>
                    <b>Rapid delivery</b> - це компанія, що забезпечує сервіс експрес-доставки 
                    документів, вантажів і посилок для фізичних осіб та бізнесу.
                </p>
                <p>
                    Мережа Rapid delivery складається з більш ніж 2300 відділень, понад 1400 
                    поштоматів для видачі/прийому посилок та 40 сортувально-перевантажувальних 
                    терміналів. Географія нашої мережі охоплює майже 1000 міст. 
                    Крім доставки у відділення, компанія здійснює адресну доставку у більш ніж 
                    <b>28 000 населених пунктів</b>.
                </p>
                <p>
                    Автопарк налічує понад 3600 автомобілів. За 2016 рік компанія доставила
                    понад <b>110 млн відправлень</b>.
                </p>
                <p>Компанія надає послуги міжнародної доставки у <b>200 країн світу</b>.</p>
                <p>Загальний штат працівників компанії перевищує <b>23 000 осіб</b>.</p>
                <p>
                    Місія компанії – робити доставку легкою для життя і бізнесу, спрощувати життя 
                    клієнтам. Для цього наша команда впроваджує нові продукти і сервіси, орієнтуючись 
                    на міжнародні стандарти та кращий світовий досвід.
                </p>
                <div className="location mb-4">
                    <div className="row p-3">    
                        <div className="col">
                            <strong>Адреса:</strong> Україна, м.Київ, пл. Майдан Незалежності, 1 
                            <br/>
                            <strong>Телефон:</strong> 0-800-500-609 
                        </div>
                        <div className="col-6 d-none d-xl-block d-lg-block">
                            <img className="map img-fluid w-100" src="/images/map.png" alt="map"/> 
                        </div>
                    </div>
                    <div className="d-lg-none d-xl-none">
                        <img className="map px-4 pb-2 w-100" src="/images/map.png" alt="map"/> 
                    </div>
                </div>
            </React.Fragment>
        );
    }
}

export default AboutPage;